In [5]:
# Bonus: Import the SQL database into Pandas

# Pandas
import pandas as pd

# # SQL Alchemy
# from sqlalchemy import create_engine


# database_path ="EmployeeSQL/employee_query_working.sqlite"

In [6]:
# path working?
# database_path

In [7]:
# # Create Engine
# engine = create_engine(f"sqlite:///{database_path}")
# conn = engine.connect()

In [8]:
# Query All Records in the the Database
#data = pd.read_sql("SELECT * FROM employee_query_working", conn)

# under the hood (in the read_sql documentation) if what is passed to conn is engine
# then do the engine.connect first.
#data = pd.read_sql("SELECT * FROM Census_Data", engine)

In [9]:

# use the code below to get started:
#This step may require some research. Feel free to use the code below to get started. 
#Be sure to make any necessary modifications for your username, password, host, port, and database name:

# # ```sql
# from sqlalchemy import create_engine
# engine = create_engine('postgresql://postgres:postgres@localhost:5432/EmployeeSQL')
# connection = engine.connect()
# #   ```

#* Consult [SQLAlchemy documentation]
# (https://docs.sqlalchemy.org/en/latest/core/engines.html#postgresql) for more information.


#* If using a password, do not upload your password to your GitHub repository. 
# See 
# [https://www.youtube.com/watch?v=2uaTPmNvH0I]
#    (https://www.youtube.com/watch?v=2uaTPmNvH0I) and 
# [https://help.github.com/en/github/using-git/ignoring-files]
# (https://help.github.com/en/github/using-git/ignoring-files) for more information.

In [19]:
#import csv's
dept_csv= "data/departments.csv"
dept_emp_csv= "data/dept_emp.csv"
dept_mgr_csv= "data/dept_manager.csv"
employees_csv= "data/employees.csv"
salaries_csv= "data/salaries.csv"
titles_csv= "data/titles.csv"

In [20]:
# create a DataFrame for each csv
dept_df=pd.read_csv(dept_csv)
dept_emp_df=pd.read_csv(dept_emp_csv)
dept_mgr_df=pd.read_csv(dept_mgr_csv)
employees_df=pd.read_csv(employees_csv)
salaries_df=pd.read_csv(salaries_csv)
titles_df=pd.read_csv(titles_csv)

In [39]:
#dept_df.head()

In [40]:
.head()

SyntaxError: invalid syntax (<ipython-input-40-6e0481ce64fb>, line 1)

In [34]:
# Merge the 6 DataFrames together bsed on common columns
employees_salaries_df=pd.merge(employees_df, salaries_df, on="emp_no")
employees_salaries_df

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991,53422
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992,48973
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987,40000
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991,40000
...,...,...,...,...,...,...,...,...
300019,464231,s0001,8/14/1958,Constantino,Eastman,M,10/28/1988,69696
300020,255832,e0002,5/8/1955,Yuping,Dayang,F,2/26/1995,75355
300021,76671,s0001,6/9/1959,Ortrud,Plessier,M,2/24/1988,61886
300022,264920,s0001,9/22/1959,Percy,Samarati,F,9/8/1994,62772
300023,464503,s0002,5/31/1964,Arvind,Slobodova,M,11/23/1987,41708

In [37]:
# Merge the employees_salaries_df to the dept_emp_df on the emp_no
employees_dept_emp_df=pd.merge(employees_salaries_df, dept_emp_df, on="emp_no")
employees_dept_emp_df

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,d002
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991,53422,d004
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992,48973,d004
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987,40000,d003
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991,40000,d006
...,...,...,...,...,...,...,...,...,...
331598,255832,e0002,5/8/1955,Yuping,Dayang,F,2/26/1995,75355,d004
331599,76671,s0001,6/9/1959,Ortrud,Plessier,M,2/24/1988,61886,d007
331600,264920,s0001,9/22/1959,Percy,Samarati,F,9/8/1994,62772,d002
331601,264920,s0001,9/22/1959,Percy,Samarati,F,9/8/1994,62772,d007
331602,464503,s0002,5/31/1964,Arvind,Slobodova,M,11/23/1987,41708,d008

In [38]:
# Merge the employees_dept_emp_df to the dept_mgr_df on the dept_no
employee_dept_mgr_df= pd.merge(employees_dept_emp_df, dept_mgr_df, on="dept_no")
employee_dept_mgr_df

,emp_no_x,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no,emp_no_y
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,d002,110085
1,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,d002,110114
2,461591,s0002,11/17/1964,Xudong,Samarati,M,11/13/1985,40000,d002,110085
3,461591,s0002,11/17/1964,Xudong,Samarati,M,11/13/1985,40000,d002,110114
4,48085,s0001,1/19/1964,Venkatesan,Gilg,M,6/28/1993,63016,d002,110085
...,...,...,...,...,...,...,...,...,...,...
897565,250135,s0001,12/2/1964,Genki,Tagansky,F,6/7/1990,68817,d001,110039
897566,17952,s0001,12/5/1963,Gina,Munawer,M,7/3/1992,53220,d001,110022
897567,17952,s0001,12/5/1963,Gina,Munawer,M,7/3/1992,53220,d001,110039
897568,417966,s0001,3/1/1952,Tristan,Msuda,F,2/11/1987,42456,d001,110022
897569,417966,s0001,3/1/1952,Tristan,Msuda,F,2/11/1987,42456,d001,110039

In [51]:
#merge title and deptarments
#len(titles_df)

employee_dept_mgr_df_one=pd.merge(employee_dept_mgr_df, dept_df, on="dept_no")
employee_dept_mgr_df_one

#cannot merge titles_df due to no columns being the same

#title_employee_df=pd.merge(employee_dept_mgr_df_one, titles_df, on="title_id")
#title_employee_df

,emp_no_x,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no,emp_no_y,dept_name
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,d002,110085,Finance
1,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,d002,110114,Finance
2,461591,s0002,11/17/1964,Xudong,Samarati,M,11/13/1985,40000,d002,110085,Finance
3,461591,s0002,11/17/1964,Xudong,Samarati,M,11/13/1985,40000,d002,110114,Finance
4,48085,s0001,1/19/1964,Venkatesan,Gilg,M,6/28/1993,63016,d002,110085,Finance
...,...,...,...,...,...,...,...,...,...,...,...
897565,250135,s0001,12/2/1964,Genki,Tagansky,F,6/7/1990,68817,d001,110039,Marketing
897566,17952,s0001,12/5/1963,Gina,Munawer,M,7/3/1992,53220,d001,110022,Marketing
897567,17952,s0001,12/5/1963,Gina,Munawer,M,7/3/1992,53220,d001,110039,Marketing
897568,417966,s0001,3/1/1952,Tristan,Msuda,F,2/11/1987,42456,d001,110022,Marketing
897569,417966,s0001,3/1/1952,Tristan,Msuda,F,2/11/1987,42456,d001,110039,Marketing

In [48]:
#2. Create a histogram to visualize the most common salary ranges for employees.
titles_df

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [ ]:
#3. Create a bar chart of average salary by title.